Tekla Open API Reference for Tekla Structures 2025
Mark.MarkAttributes Constructor (ModelObject)
 Creates a new default mark attributes instance that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MarkAttributes(
	ModelObject modelObject
)
Public Sub New (
	modelObject As ModelObject
)
Parameters
modelObject
Type: Tekla.Structures.Drawing.ModelObject
The ModelObject defining the content to load.
See Also
Reference
Mark.MarkAttributes Class
Mark.MarkAttributes Overload
Tekla.Structures.Drawing Namespace